/**
 * 
 *@author steven.yan
 *
 */

#import "RootVcPanel3.h"

@implementation RootVcPanel3



#pragma mark -
#pragma mark --------------------------初始化 ,销毁-------------------------------
/*------------------------------------------------------------------------------
 |  初始化 ,销毁
 |
 -----------------------------------------------------------------------------*/
- (id)initWithVc:(BaseVc *)vc {
    if (self = [super initWithFrame:CGRectMake(0, 0, vc.view.width, vc.view.height - [SysInfo instance].bottomPanelHeight)]) {
        //页面
        self.nrVc = vc;
        //-

        //控件-------------------
        TopPanel *tp = [[TopPanel alloc] init];
        tp.ctrlLeftBtn.hidden = YES;
        tp.ctrlRightBtn.hidden = YES;
        [tp changeTitle:@"预约"];
        [self addSubview:tp];
        
        //数据-------------------
    }
    
    return self;
}



#pragma mark -
#pragma mark ------------------------------方法----------------------------------
/*------------------------------------------------------------------------------
 |  方法
 |
 -----------------------------------------------------------------------------*/




#pragma mark -
#pragma mark ------------------------------其他----------------------------------
/*------------------------------------------------------------------------------
 |  其他
 |
 -----------------------------------------------------------------------------*/



@end
