/**
 *
 *@author steven.yan
 *@date Sep 21 2014
 *
 **/

#import "TabBarContentPanel.h"

@implementation TabBarContentPanel



#pragma mark -
#pragma mark --------------------------初始化 ,销毁-------------------------------
/*------------------------------------------------------------------------------
 |  初始化 ,销毁
 |
 -----------------------------------------------------------------------------*/
- (id)initWithVc:(BaseLayoutVc *)vc frame:(CGRect)frame {
    if (self = [super initWithFrame:frame]) {
        //页面------
        self.nrVc = vc;
        self.height = self.height - SysInfo.instance.tabBarPanelHeight;
        //数据------
        //其他------
    }
    
    return self;
}

- (void)onWillShow {
}

- (void)onWillHide {
}



#pragma mark -
#pragma mark ------------------------------方法----------------------------------
/*------------------------------------------------------------------------------
 |  方法
 |
 -----------------------------------------------------------------------------*/



#pragma mark -
#pragma mark ------------------------------其他----------------------------------
/*------------------------------------------------------------------------------
 |  其他
 |
 -----------------------------------------------------------------------------*/



@end
